KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/РаспределениеЗапасов/РаспределениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="45342faa-1ece-480b-81d1-d8e80e853d58">
  <name>РаспределениеЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="63380d67-a9d1-4dad-8840-41c7249204ab">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b1640808-e7c6-4807-936d-bd90cf45049d">
    <name>Свободно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="261e7ab2-2140-4288-a9b8-49b2ba6ae33a">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="071db416-83a1-49bb-8727-0c50e9b7962d">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7ebc9523-5df4-4dfc-ab70-41061e5b8b4f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c3838a94-5f51-4ad4-832f-097e04916376">
    <name>ЗаказНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="908bbc1b-86a0-43c8-b40a-a1c31cf89ac3">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2a3bab03-6376-456d-9d36-7b51914fe435">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aca20c25-c763-4dc8-909a-2cbf809a16f1">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/РаспределениеЗапасовСостояния/РаспределениеЗапасовСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="545815ed-aef9-41ce-93e4-8bbe4895c3db">
  <name>РаспределениеЗапасовСостояния</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9aaf3c33-fa09-46b0-a070-7cebf529de9c">
    <name>ОбеспеченНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47d10a43-5556-4259-bde6-880106968b77">
    <name>ОстатокНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Forms/КАНАТ_ФормаВыбораВспомогательногоСырья/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура.ТекстЗапроса = " ВЫБРАТЬ
|	СправочникНоменклатура.Ссылка КАК Ссылка,
|	СправочникНоменклатура.ПометкаУдаления КАК ПометкаУдаления,
|	СправочникНоменклатура.Код КАК Код,
|	СправочникНоменклатура.Наименование КАК Наименование,
|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	СправочникНоменклатура.КАНАТ_НТДНоменклатуры КАК КАНАТ_НТДНоменклатуры,
|	СправочникНоменклатура.НаименованиеПолное КАК НаименованиеПолное,
|	СправочникНоменклатура.КАНАТКач_ВидДляКонтроляКачества КАК КАНАТКач_ВидДляКонтроляКачества,
|	СправочникНоменклатура.Артикул КАК Артикул,
|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
|	СправочникНоменклатура.КАНАТ_ТекстДублиАртикулов КАК КАНАТ_ТекстДублиАртикулов,
|	СправочникНоменклатура.КАНАТ_НеГенерироватьАртикул КАК КАНАТ_НеГенерироватьАртикул,
|
|	СправочникНоменклатура.Предопределенный КАК Предопределенный,
|	СправочникНоменклатура.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных, 
|	ВсеОстатки.ВНаличии как ВНаличии,
|	ВсеОстатки.Свободно как Свободно
|ИЗ
|	Справочник.Номенклатура КАК СправочникНоменклатура
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ(
|		ВЫБРАТЬ
|			РаспределениеЗапасов.Номенклатура    КАК Номенклатура,
|			СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
|			СУММА(РаспределениеЗапасов.Запас)    КАК Запас,
|			СУММА(РаспределениеЗапасов.Свободно) КАК Свободно
|		ИЗ
|			РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
|		ГДЕ
|			РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
|			И РаспределениеЗапасов.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
|			И РаспределениеЗапасов.Склад В(&Склад)
|		СГРУППИРОВАТЬ ПО
|			РаспределениеЗапасов.Номенклатура
|	) КАК ВсеОстатки
|	ПО 
|		(ВсеОстатки.Номенклатура = СправочникНоменклатура.Ссылка)
|
|ГДЕ
|	СправочникНоменклатура.ГруппаФинансовогоУчета В (&ГруппаФинУчета)";
	Номенклатура.Параметры.УстановитьЗначениеПараметра("ГруппаФинУчета",Параметры.ГруппаФинУчета);
	Номенклатура.Параметры.УстановитьЗначениеПараметра("Склад",Параметры.Склад);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВНаличииПриИзменении(Элемент)  
	Номенклатура.Отбор.Элементы.Очистить();
	Если ТолькоВНаличии Тогда
	ЭлементОтбора = Номенклатура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВНаличии");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	                         КонецЕсли;
КонецПроцедуры


//ОбновитьЗапросНаСервере
//	СхемаЗапроса = Новый СхемаЗапроса;
//	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);  
//	
//	Если ЗначениеЗаполнено(Подразделение) тогда
//		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Подразделение = &Подразделение)");
//		Запрос.УстановитьПараметр("Подразделение", Подразделение);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(СтатусЭтапа) тогда
//		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус В(&Статусы))");
//		Запрос.УстановитьПараметр("Статусы", СтатусЭтапа);
//	КонецЕсли;
//	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
